<script>
  // preventDefault — вызывает event.preventDefault() перед запуском обработчика. Полезно в т.ч. для обработки форм на клиентской стороне.
  // stopPropagation — вызывает event.stopPropagation(), предотвращает распространение события до следующих элементов
  // passive — улучшает производительность прокрутки при тач-событиях или при прокрутке колёсиком мышки (Svelte добавит этот модификатор автоматически там, где это безопасно)
  // nonpassive — явно устанавливает passive: false
  // capture — вызывает событие в режиме перехвата вместо всплытия (см. документацию MDN)
  // once — удаляет обработчик события после первого вызова
  // self — вызывает событие, только если event.target указывает на этот же элемент
  // trusted — обработчик сработает, только если event.isTrusted имеет значение true. Т.е. если событие инициируется действием пользователя.

  function handleClick() {
    alert('Кнопка нажата')
  }
</script>

<button on:click|once={handleClick}>
    Нажми меня
</button>