<script>
  /**
   реактивные объявления - вычисление данных засчет других, при изменении одних переменных
   будут изменены другие.

   Реактивные объявления становятся гораздо полезнее,
   когда нужно ссылаться на них несколько раз, или у вас есть значения, которые зависят от других реактивных значений.
   */
  let count = 0;
  $: doubled = count * 2;
  function handleClick() {
    count += 1;
  }

  /**
   *
   * Мы не ограничены объявлением реактивных значений - мы также можем реактивно запускать произвольные выражения.
   * */
  $: {
    console.log('count = ', count)
  }
</script>

<button on:click={handleClick}>
    {count === 0 ? 'Кликни по мне' : `Кликов: ${count}`}
</button>

<p>Удвоим {count} и получим {doubled}</p>